---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid2Offset
source: html/6bcb03e8-8925-48b4-44d7-09fc6cdc287c.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid2Offset Property

The offset for V grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public double Grid2Offset { get; set; }
```